---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.TransientElementCreationException
source: html/a7239ec6-f8e1-4068-9a15-59ce6cf6012a.htm
---
# TransientElementCreationException Properties

The information of the function throwing the exception.